{
  "backend/main.mo": "Main canister actor with user profiles, posts, comments, chat, test history, daily tasks, and access-control-protected CRUD operations using storage and authorization mixins.",
  "backend/migration.mo": "Migration module upgrading old userProfiles to a new schema by adding email and photoUrl fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the functionality of various frontend files including pages, hooks, components, and utilities.",
  "frontend/index.css": "Global Tailwind-based style definitions with light/dark theme CSS variables and base element styling.",
  "frontend/index.html": "HTML entry point with pre-hydration theme bootstrap and script loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with a QueryClientProvider.",
  "frontend/src/components/AppLayout.tsx": "Root layout applying theme, welcome overlay, hiding UI on certain routes, and bootstrapping user profile before rendering child routes.",
  "frontend/src/components/community/ChatPanel.tsx": "A group chat interface that lists messages, allows authenticated users to send messages, and lets admins delete them.",
  "frontend/src/components/community/CommentsSection.tsx": "Displays comments for a post, allows authenticated users to add comments, and lets admins delete them.",
  "frontend/src/components/community/ErrorBanner.tsx": "An alert banner that displays an error message with an optional dismiss button.",
  "frontend/src/components/community/PostCard.tsx": "Shows a community post with image, caption, likes, comments, and admin controls for deleting or blocking users.",
  "frontend/src/components/community/PostComposer.tsx": "A form for creating new posts with image upload, caption input, validation, and upload progress.",
  "frontend/src/components/dailyTarget/DailyTaskItem.tsx": "A task item with checkbox, edit and delete actions, supporting inline editing and status updates.",
  "frontend/src/components/dashboard/DashboardBackgroundControls.tsx": "Provides UI to upload, validate, save, or reset a dashboard background image with auth checks and error handling.",
  "frontend/src/components/FocusBabuLogo.tsx": "Clickable logo component that navigates to the home route and supports different size variants.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and clearing query cache on sign-out.",
  "frontend/src/components/ncert/ChapterList.tsx": "Renders a list of NCERT chapters with PDF view and download actions, including URL validation and error alerts.",
  "frontend/src/components/ncert/ClassSection.tsx": "Displays an expandable class section that reveals subject cards for physics, chemistry, biology, and mathematics.",
  "frontend/src/components/ncert/SubjectCard.tsx": "Shows an expandable subject card that lists chapters or parts using ChapterList components.",
  "frontend/src/components/PomodoroTimer/ColorControls.tsx": "Provides preset and custom color selection for the timer and syncs changes with parent state.",
  "frontend/src/components/PomodoroTimer/DurationControls.tsx": "Lets users adjust focus and break durations with buttons and numeric inputs, enforcing valid ranges.",
  "frontend/src/components/PomodoroTimer/MetricsPanel.tsx": "Displays daily session count and streak, refreshing metrics periodically.",
  "frontend/src/components/PomodoroTimer/MusicControls.tsx": "Toggles background lo‑fi music using localStorage and an audio hook.",
  "frontend/src/components/PomodoroTimer/PomodoroTimer.tsx": "Main Pomodoro timer UI coordinating timer logic, audio cues, quotes, metrics, and control panels.",
  "frontend/src/components/PomodoroTimer/ProgressRing.tsx": "Renders an SVG circular progress ring with glow and animated stroke offset.",
  "frontend/src/components/PomodoroTimer/SoundControls.tsx": "Toggles ticking sound and shows bell notification info.",
  "frontend/src/components/PomodoroTimer/usePomodoroTimer.ts": "Custom hook managing durations, countdown logic, session switching, colors, and ticking state with persistence.",
  "frontend/src/components/SiteNav.tsx": "Navigation bar that hides in streamer mode on the timer page and provides route buttons and login.",
  "frontend/src/components/SocialLinks.tsx": "Displays Instagram and X links with size variants for header or footer.",
  "frontend/src/components/testSeries/ExamSession.tsx": "Implements a timed exam interface with questions, navigation, answer tracking, and submission handling.",
  "frontend/src/components/testSeries/previousYear/PreviousYearExamSession.tsx": "Manages navigation, timing, answer selection, and submission flow for previous-year exam papers.",
  "frontend/src/components/testSeries/previousYear/PreviousYearTestResults.tsx": "Calculates and displays results for previous-year exams with score, accuracy, and save-status alerts.",
  "frontend/src/components/testSeries/PreviousYearPapersSection.tsx": "Lists previous year exam papers by exam type and provides start buttons for each paper via PaperCard components.",
  "frontend/src/components/testSeries/TestHistory.tsx": "Displays a user's test history, handling authentication, loading states, errors, and empty history with profile info.",
  "frontend/src/components/testSeries/TestResults.tsx": "Shows detailed results for a completed test, including score metrics, save-status messages, and user answer evaluation.",
  "frontend/src/components/ThemeToggleButton.tsx": "A button that toggles between dark and light themes using useTheme and displays Sun or Moon icons.",
  "frontend/src/components/user/AuthProfileBootstrapper.tsx": "Prefetches and updates the user profile after authentication without rendering UI.",
  "frontend/src/components/user/UserAvatar.tsx": "Renders a user avatar with optional photo and fallback initials, supporting multiple sizes.",
  "frontend/src/components/WelcomeMotivationOverlay.tsx": "A temporary full‑screen overlay that shows a random motivational message and fades out automatically.",
  "frontend/src/hooks/community/useChat.ts": "Provides hooks for fetching and sending chat messages with automatic polling and cache updates.",
  "frontend/src/hooks/community/useComments.ts": "Implements comment retrieval and creation with React Query and backend actor integration.",
  "frontend/src/hooks/community/useModeration.ts": "Contains admin-related hooks for deleting posts, comments, chat messages, and blocking users.",
  "frontend/src/hooks/community/usePosts.ts": "Handles fetching, creating, and liking posts with backend actor calls and cache invalidation.",
  "frontend/src/hooks/community/useUserProfiles.ts": "Provides hooks to fetch a user profile by principal and derive a display name using React Query.",
  "frontend/src/hooks/dailyTarget/useDailyTarget.ts": "Implements CRUD hooks for per-user daily tasks stored in localStorage and synced via React Query.",
  "frontend/src/hooks/testSeries/useCountdownTimer.ts": "A countdown timer hook with start, stop, reset, and internal interval handling.",
  "frontend/src/hooks/testSeries/useTestHistory.ts": "Hooks to fetch and save test results through the backend using React Query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAudio.ts": "Controls audio playback via a reusable hook with play, pause, and loop support.",
  "frontend/src/hooks/useAuthState.ts": "Returns current authentication state, derived principal strings, and login status flags.",
  "frontend/src/hooks/useDashboardBackground.ts": "Fetches, uploads, and clears dashboard background blobs via backend actor with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity persistence, and status management.",
  "frontend/src/hooks/useLocalStorageState.ts": "Syncs a React state value with localStorage for persistence.",
  "frontend/src/hooks/useQueries.ts": "Contains hooks for fetching and saving caller and arbitrary user profiles using React Query.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state persisted in localStorage.",
  "frontend/src/index.css": "Global CSS defining fonts, Tailwind layers, theming variables, and animated background styles.",
  "frontend/src/lib/branding.ts": "Defines branding constants and helpers for site name, tagline, and app identifier.",
  "frontend/src/lib/color.ts": "Provides utilities to convert hex colors to RGBA and generate glow or text-shadow effects, plus hex color validation.",
  "frontend/src/lib/ncertData.ts": "Defines NCERT class, subject, and chapter metadata and embeds Class 11 textbook chapter lists with official PDF links.",
  "frontend/src/lib/ncertLinks.ts": "Validates NCERT PDF URLs, safely encodes/decodes them, and provides an error message for invalid links.",
  "frontend/src/lib/previousYearPapers/catalog.ts": "Contains a static catalog of previous year exam papers for JEE Main, NEET, and CUET.",
  "frontend/src/lib/previousYearPapers/index.ts": "Exports catalog, types, and a registry mapping paper IDs to metadata, with helpers to fetch papers and filter by exam.",
  "frontend/src/lib/previousYearPapers/papers/cuet-sample-structure.ts": "Defines sample CUET 2023 and 2024 papers with generated sections and placeholder multiple‑choice questions.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2021.ts": "Defines the JEE Main 2021 paper with physics and chemistry sections and manually written MCQs.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2022.ts": "Defines the JEE Main 2022 paper with physics and chemistry sections and fixed MCQs.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2023-all-shifts.ts": "Defines the JEE Main 2023 all‑shifts paper with physics and chemistry MCQs, some including solutions.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2024-all-shifts.ts": "Defines detailed JEE Main 2024 all‑shifts paper metadata with physics questions and solutions.",
  "frontend/src/lib/previousYearPapers/papers/neet-2021.ts": "Provides NEET 2021 paper metadata with autogenerated questions across four sections.",
  "frontend/src/lib/previousYearPapers/papers/neet-2022.ts": "Defines NEET 2022 paper using template-generated questions for all subjects.",
  "frontend/src/lib/previousYearPapers/papers/neet-2023.ts": "Supplies NEET 2023 exam metadata with auto‑generated section questions.",
  "frontend/src/lib/previousYearPapers/papers/neet-2024.ts": "Contains NEET 2024 paper with explicit physics and chemistry questions and answers.",
  "frontend/src/lib/previousYearPapers/types.ts": "Declares TypeScript interfaces for structuring previous‑year exam papers, sections, and questions.",
  "frontend/src/lib/quotes.ts": "Stores a list of motivational quotes and exposes a random‑quote selector.",
  "frontend/src/lib/studyMetrics.ts": "Manages study session metrics in localStorage, tracking streaks and daily sessions.",
  "frontend/src/lib/testSeriesData.ts": "Defines test series question types, sample sets, validation helpers, and config generators.",
  "frontend/src/lib/userIdentity.ts": "Provides helpers for resolving display names and deriving user initials.",
  "frontend/src/lib/welcomeMotivationMessages.ts": "Contains predefined welcome messages and a function to pick one randomly.",
  "frontend/src/main.tsx": "Entry point rendering the React app with query client and identity provider.",
  "frontend/src/pages/CommunityPage.tsx": "Renders the community page with posts, chat panel, and login prompts, fetching and displaying posts when authenticated.",
  "frontend/src/pages/DailyTargetPage.tsx": "Displays daily tasks with add, edit, toggle, delete, and reset functionality, handling auth-gated interactions and error states.",
  "frontend/src/pages/LandingPage.tsx": "Shows the landing page with timer, social links, and optional custom background based on authentication.",
  "frontend/src/pages/NcertPage.tsx": "Lists NCERT book sections for classes 11 and 12 with a header and footer.",
  "frontend/src/pages/NcertPdfViewerPage.tsx": "Validates NCERT PDF URLs and redirects to the main PDF viewer or NCERT page, showing a loading state.",
  "frontend/src/pages/PdfViewerPage.tsx": "Implements a PDF viewer with navigation, zoom controls, download, and validation handling for NCERT PDFs.",
  "frontend/src/pages/TestSeriesPage.tsx": "Manages test series views including starting tests, submitting answers, calculating results, and saving history.",
  "frontend/src/pages/TimerPage.tsx": "Provides a standalone Pomodoro timer with persistent streamer and transparency settings.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark mode, content paths, custom colors, typography, container settings, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app features, architecture notes, issues, and versioned feature list for the Focus Babu study website."
}