{
  "backend/main.mo": "Main Motoko actor implementing user profiles, community posts with likes/comments, chat messages, test results tracking, daily tasks, and blob storage with access control via mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including profile auto-sync, removal of custom usernames, Study Room navigation with Google Meet integration, and confirmation dialogs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, Pomodoro timer, study metrics, community features, NCERT viewer, test series, and UI utilities.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH dark navy/black color palette optimized for dark mode study interface with custom CSS variables for theming.",
  "frontend/index.html": "HTML entry point with pre-hydration theme bootstrap script that applies dark mode class before React mounts to prevent flash of unstyled content.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, timer, community, NCERT, PDF viewer, test series, and daily target pages wrapped in QueryClientProvider.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper component managing theme application, theme toggle visibility, welcome overlay display logic, and authentication profile bootstrapping for all routes.",
  "frontend/src/components/community/ChatPanel.tsx": "Group chat component with scrollable message list, message input form, and admin delete functionality for messages.",
  "frontend/src/components/community/CommentsSection.tsx": "Displays comments for a post with add/delete functionality, showing user avatars and timestamps with admin moderation controls.",
  "frontend/src/components/community/ErrorBanner.tsx": "Reusable error alert banner with an optional dismiss button for displaying error messages.",
  "frontend/src/components/community/PostCard.tsx": "Displays a social media post with image, caption, like button, comments section, and admin controls for deletion and user blocking.",
  "frontend/src/components/community/PostComposer.tsx": "Form for creating new posts with image upload (max 5MB), caption input (max 500 chars), and upload progress tracking.",
  "frontend/src/components/dailyTarget/DailyTaskItem.tsx": "Individual task item with checkbox for completion, inline editing capability, and delete button with loading states.",
  "frontend/src/components/dashboard/DashboardBackgroundControls.tsx": "Provides UI controls for uploading custom dashboard backgrounds or resetting to default, with authentication checks, file validation (type/size), and error handling using mutation hooks.",
  "frontend/src/components/FocusBabuLogo.tsx": "Reusable logo component with navbar and centered variants, click navigation to homepage, and hover effects with focus accessibility.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity hook to handle sign-in/sign-out with loading states and query cache clearing on logout.",
  "frontend/src/components/ncert/ChapterList.tsx": "Displays a list of NCERT chapters with view and download buttons for each PDF, validating URLs and handling navigation to the PDF viewer or triggering downloads.",
  "frontend/src/components/ncert/ClassSection.tsx": "Renders an expandable/collapsible card for a class (e.g., Class 11/12) that displays subject cards (Physics, Chemistry, Biology, Mathematics) when expanded.",
  "frontend/src/components/ncert/SubjectCard.tsx": "Displays an expandable card for a subject showing its chapters, supporting both single-part and multi-part subjects with nested chapter lists.",
  "frontend/src/components/PomodoroTimer/ColorControls.tsx": "Provides a color picker UI with preset colors and custom hex input for changing the Pomodoro timer color. Syncs custom color input with parent state changes.",
  "frontend/src/components/PomodoroTimer/DurationControls.tsx": "Renders controls for adjusting focus and break durations with increment/decrement buttons and direct number input, clamped between 1-120 minutes for focus and 1-60 for breaks.",
  "frontend/src/components/PomodoroTimer/MetricsPanel.tsx": "Displays study metrics including daily sessions completed and current streak, polling for updates every 5 seconds from the studyMetrics library.",
  "frontend/src/components/PomodoroTimer/MusicControls.tsx": "Provides a toggle switch for enabling/disabling lo-fi background music during study sessions, persisting state to localStorage and controlling audio playback.",
  "frontend/src/components/PomodoroTimer/PomodoroTimer.tsx": "Main Pomodoro timer component orchestrating timer display, controls, audio playback, session completion handling, motivational quotes, and metrics tracking. Supports streamer mode and transparent background options.",
  "frontend/src/components/PomodoroTimer/ProgressRing.tsx": "Renders an SVG circular progress ring with customizable size, stroke width, and color, including a glowing effect for the active progress arc.",
  "frontend/src/components/PomodoroTimer/SoundControls.tsx": "Provides a toggle switch for enabling/disabling the ticking sound during timer operation, with a note about automatic bell sound on session completion.",
  "frontend/src/components/PomodoroTimer/usePomodoroTimer.ts": "Custom hook managing Pomodoro timer state including countdown logic, session switching, duration settings, color preferences, and timer controls (start/pause/reset/skip) with localStorage persistence.",
  "frontend/src/components/SiteNav.tsx": "Main navigation bar component with links to all major sections (Home, NCERT, Test Series, Daily Target, Community, Study Room) and login button. Hides in streamer mode on timer route.",
  "frontend/src/components/SocialLinks.tsx": "Renders social media links (Instagram and X/Twitter) with configurable icon sizes and spacing for header or footer variants.",
  "frontend/src/components/studyRoom/StudyRoomConfirmDialog.tsx": "A confirmation dialog that opens a Google Meet link for the Focus Babu Study Room when the user confirms joining the group study session.",
  "frontend/src/components/testSeries/ExamSession.tsx": "Manages an active exam session with question navigation, answer selection, countdown timer, and submit/exit dialogs for test-taking functionality.",
  "frontend/src/components/testSeries/previousYear/PreviousYearExamSession.tsx": "Manages the exam session UI for previous year papers with countdown timer, section navigation, question palette, answer selection, and mark-for-review functionality; handles auto-submit on timeout and manual submission.",
  "frontend/src/components/testSeries/previousYear/PreviousYearTestResults.tsx": "Displays results for previous year paper tests with summary statistics and detailed section-wise question review showing user answers, correct answers, and marked-for-review status; includes save status alerts.",
  "frontend/src/components/testSeries/PreviousYearPapersSection.tsx": "Displays categorized previous year papers for JEE Main, NEET, and CUET exams in a grid layout with start buttons for each paper.",
  "frontend/src/components/testSeries/TestHistory.tsx": "Displays authenticated user's test history in a table with scores, accuracy, and timestamps; shows sign-in prompt for unauthenticated users and handles loading/error states.",
  "frontend/src/components/testSeries/TestResults.tsx": "Renders test completion results with summary cards (score, accuracy, correct/incorrect counts) and detailed question-by-question review; displays save status alerts for authenticated and unauthenticated users.",
  "frontend/src/components/ThemeToggleButton.tsx": "Fixed-position button that toggles between light and dark themes, displaying a moon or sun icon based on current theme.",
  "frontend/src/components/user/AuthProfileBootstrapper.tsx": "Non-visual component that automatically fetches user profile after login and creates a default profile with auto-generated displayName if none exists.",
  "frontend/src/components/user/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/user/UserAvatar.tsx": "Renders a user avatar component with optional photo URL or fallback initials, supporting three size variants (sm, md, lg).",
  "frontend/src/components/WelcomeMotivationOverlay.tsx": "Full-screen overlay that displays a random welcome message for ~1 second with fade-in/fade-out animations on initial page load.",
  "frontend/src/hooks/community/useChat.ts": "Provides React Query hooks for fetching chat messages (with 3-second polling) and sending new messages with automatic cache invalidation.",
  "frontend/src/hooks/community/useComments.ts": "Provides React Query hooks for fetching comments by post ID and adding new comments with automatic cache invalidation for both comments and posts.",
  "frontend/src/hooks/community/useModeration.ts": "Provides React Query hooks for admin moderation actions including checking admin status, deleting posts/comments/chat messages, and blocking users with cache invalidation.",
  "frontend/src/hooks/community/usePosts.ts": "Provides React Query hooks for fetching all posts, creating new posts with image and caption, and liking posts with automatic cache invalidation.",
  "frontend/src/hooks/community/useUserProfiles.ts": "Provides hooks to fetch user profiles by principal string and resolve display names using React Query and the actor backend.",
  "frontend/src/hooks/dailyTarget/useDailyTarget.ts": "Manages daily task CRUD operations using localStorage for persistence, providing hooks for fetching, adding, updating, and deleting tasks per user principal.",
  "frontend/src/hooks/testSeries/useCountdownTimer.ts": "Implements a countdown timer hook with start, stop, and reset functionality using React state and intervals.",
  "frontend/src/hooks/testSeries/useTestHistory.ts": "Provides hooks to fetch test history and save test results to the backend using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAudio.ts": "Manages HTML5 audio playback with play/pause controls and loop support using refs and state.",
  "frontend/src/hooks/useAuthState.ts": "Provides authentication state including authenticated status, principal string, and login status derived from Internet Identity.",
  "frontend/src/hooks/useDashboardBackground.ts": "Manages dashboard background images with hooks to get, save, and clear backgrounds using ExternalBlob and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider with login, logout, and identity management using AuthClient.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs React state with localStorage, providing persistent state across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for fetching and saving user profiles (both caller and by principal) using React Query and the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and toggle functionality.",
  "frontend/src/index.css": "Defines global styles, CSS custom properties for light/dark themes using OKLCH color space, and animated gradient background effects.",
  "frontend/src/lib/branding.ts": "Centralizes branding constants like site name, tagline, and provides utility functions for copyright text and app identifier.",
  "frontend/src/lib/color.ts": "Provides color utility functions including hex-to-rgba conversion, glow effect generation for drop-shadows, text shadow generation, and hex color validation.",
  "frontend/src/lib/ncertData.ts": "Defines TypeScript interfaces and data structures for NCERT chapters, subjects, and classes (Class 11 and 12), including official PDF URLs for Physics, Chemistry, Biology, and Mathematics textbooks.",
  "frontend/src/lib/ncertLinks.ts": "Validates NCERT PDF URLs to ensure they come from official ncert.nic.in domains, and provides encoding/decoding utilities for safe URL handling in navigation parameters.",
  "frontend/src/lib/previousYearPapers/catalog.ts": "Exports a catalog array of previous year paper entries for JEE Main, NEET, and CUET exams from 2021-2024, including metadata like exam type, year, shift, and unique IDs.",
  "frontend/src/lib/previousYearPapers/index.ts": "Central registry and export point for previous year papers, providing functions to retrieve papers by ID or filter by exam type, and importing all paper metadata modules.",
  "frontend/src/lib/previousYearPapers/papers/cuet-sample-structure.ts": "Defines CUET 2024 and 2023 paper metadata with three sections (Languages, Domain Subjects, General Test), each containing 10 sample multiple-choice questions.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2021.ts": "Contains JEE Main 2021 paper metadata with Physics, Chemistry, and Mathematics sections, each having 10 multiple-choice questions with prompts, options, and correct answers.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2022.ts": "Contains JEE Main 2022 paper metadata structured with Physics, Chemistry, and Mathematics sections, each with 10 multiple-choice questions covering fundamental concepts.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2023-all-shifts.ts": "Defines JEE Main 2023 (All Shifts) paper metadata with Physics, Chemistry, and Mathematics sections, including questions with optional solution explanations.",
  "frontend/src/lib/previousYearPapers/papers/jee-main-2024-all-shifts.ts": "Exports JEE Main 2024 paper metadata with 10 Physics and partial Chemistry questions, including prompts, options, correct answers, and solutions.",
  "frontend/src/lib/previousYearPapers/papers/neet-2021.ts": "Exports NEET 2021 paper metadata with 10 placeholder questions each for Physics, Chemistry, Botany, and Zoology sections.",
  "frontend/src/lib/previousYearPapers/papers/neet-2022.ts": "Exports NEET 2022 paper metadata with 10 placeholder questions each for Physics, Chemistry, Botany, and Zoology sections.",
  "frontend/src/lib/previousYearPapers/papers/neet-2023.ts": "Exports NEET 2023 paper metadata with 10 placeholder questions each for Physics, Chemistry, Botany, and Zoology sections.",
  "frontend/src/lib/previousYearPapers/papers/neet-2024.ts": "Exports NEET 2024 paper metadata with 10 real questions each for Physics and Chemistry sections, plus partial Botany/Zoology.",
  "frontend/src/lib/previousYearPapers/types.ts": "Defines TypeScript types for previous year paper questions, sections, metadata, and catalog entries for JEE/NEET/CUET exams.",
  "frontend/src/lib/quotes.ts": "Provides a collection of motivational quotes and a function to randomly select one.",
  "frontend/src/lib/studyMetrics.ts": "Manages daily study session tracking and streak calculation using localStorage with date-based logic.",
  "frontend/src/lib/testSeriesData.ts": "Defines test configuration types and provides sample questions for JEE, NEET, and CUET exams with validation and duration helpers.",
  "frontend/src/lib/userIdentity.ts": "Provides utilities to resolve display names from user profiles with fallbacks and derive initials for avatars.",
  "frontend/src/lib/welcomeMotivationMessages.ts": "Exports a list of welcome motivation messages and a function to randomly select one.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the App component.",
  "frontend/src/pages/CommunityPage.tsx": "Community page displaying posts, chat panel, and post composer. Shows login prompt for unauthenticated users and sorts posts by timestamp.",
  "frontend/src/pages/DailyTargetPage.tsx": "Daily task management page with add, edit, delete, toggle, and reset functionality. Displays progress stats and requires authentication for task operations.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page featuring the Pomodoro timer, social links, and optional custom background for authenticated users. Includes site branding and footer.",
  "frontend/src/pages/NcertPage.tsx": "NCERT books directory page displaying chapter-wise books for Class 11 & 12 across Physics, Chemistry, Biology, and Mathematics.",
  "frontend/src/pages/NcertPdfViewerPage.tsx": "Legacy redirect page that validates NCERT URLs and redirects to the new unified PDF viewer route.",
  "frontend/src/pages/PdfViewerPage.tsx": "PDF viewer page with zoom, page navigation, download controls, and error handling for NCERT PDFs. Validates URLs and displays PDFs in an iframe.",
  "frontend/src/pages/TestSeriesPage.tsx": "Test series page managing mock tests and previous year papers with exam sessions, results display, test history, and result saving for authenticated users.",
  "frontend/src/pages/TimerPage.tsx": "Standalone timer page with Pomodoro timer component supporting streamer mode and transparent background options stored in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (including sidebar, chart, and theme colors), typography, container queries, animations (accordion), and custom font families (Inter, Space Grotesk).",
  "project_state.json": "Project state document (v39) describing \"Focus Babu\" study website with Pomodoro timer, streamer mode, dark/light themes, Firebase-backed community features, NCERT PDFs, test series with exam interface, and daily target tracking; includes architectural notes and known deployment/navigation issues."
}