{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files and components.",
  "frontend-file-summaries.txt": "Text file listing summarized descriptions of all frontend source files.",
  "frontend/index.css": "Global Tailwind-based CSS defining light/dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with landing and timer routes wrapped in dark mode.",
  "frontend/src/components/PomodoroTimer/ColorControls.tsx": "Color selection UI with preset colors and a custom hex picker synced to parent state.",
  "frontend/src/components/PomodoroTimer/DurationControls.tsx": "Controls for adjusting focus and break durations with validation and buttons.",
  "frontend/src/components/PomodoroTimer/MetricsPanel.tsx": "Displays daily study sessions and streak, updating every few seconds.",
  "frontend/src/components/PomodoroTimer/MusicControls.tsx": "Toggle for enabling looping background lo-fi music with localStorage persistence.",
  "frontend/src/components/PomodoroTimer/PomodoroTimer.tsx": "Main timer component handling countdown, audio, quotes, metrics, and color-styled UI.",
  "frontend/src/components/PomodoroTimer/ProgressRing.tsx": "Renders an SVG circular progress ring with animated stroke and glow effect based on progress and color.",
  "frontend/src/components/PomodoroTimer/SoundControls.tsx": "Provides UI controls for toggling ticking sound and displays bell notification info.",
  "frontend/src/components/PomodoroTimer/usePomodoroTimer.ts": "Implements full Pomodoro timer logic with state, session switching, countdown, color settings, and localStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAudio.ts": "Provides play/pause control for an audio element with optional looping and internal state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity, handling login/logout, and exposing status via context.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook syncing a state value with localStorage using JSON serialization.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Global Tailwind-based styling with theming variables, fonts, background effects, and dark mode definitions.",
  "frontend/src/lib/color.ts": "Utility functions for hex-to-RGBA conversion, glow and text-shadow generation, and hex color validation.",
  "frontend/src/lib/quotes.ts": "Stores motivational quotes and returns a random one on request.",
  "frontend/src/lib/studyMetrics.ts": "Tracks daily study sessions and streaks in localStorage with helpers for incrementing and retrieving metrics.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main landing page with a header, centered PomodoroTimer, and footer containing social links and attribution.",
  "frontend/src/pages/TimerPage.tsx": "Displays the PomodoroTimer with user-controlled streamer mode and background transparency persisted via localStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Defines the project’s state, features, requirements, and architectural notes for the study website and Pomodoro timer."
}