{
  "backend/main.mo": "Main actor defining user profiles, posts, chat messages, test histories, access control, storage mixins, and dashboard background support with CRUD-style query/update methods.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty dashboardBackground map while preserving all other fields.",
  "feature_evidence.json": "JSON report listing implemented features, related source files, components, and associated requirement IDs for UI background controls and behavior.",
  "frontend-file-summaries.txt": "Reference file providing brief descriptions of major frontend components, hooks, pages, and utilities.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color variables for light/dark themes and applying base styles.",
  "frontend/index.html": "Root HTML file bootstrapping dark/light theme before hydration and loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router and React Query, defining routes for landing, timer, community, ncert, and test-series pages.",
  "frontend/src/components/AppLayout.tsx": "Layout component applying theme class to document root and rendering nested routes with a theme toggle.",
  "frontend/src/components/community/ChatPanel.tsx": "Implements a real-time group chat UI with message sending, admin deletion, auto-scroll, and error handling.",
  "frontend/src/components/community/CommentsSection.tsx": "Displays comments for a post with authenticated adding, admin deletion, and timestamp formatting.",
  "frontend/src/components/community/ErrorBanner.tsx": "Reusable error alert component with optional dismiss button.",
  "frontend/src/components/community/PostCard.tsx": "Shows a social post with image, caption, likes, admin moderation actions, and an embedded comments section.",
  "frontend/src/components/community/PostComposer.tsx": "Form for creating a post with image upload, caption input, validation, preview, and upload progress.",
  "frontend/src/components/dashboard/DashboardBackgroundControls.tsx": "Allows users to upload or reset a dashboard background image with validation and auth checks.",
  "frontend/src/components/FocusBabuLogo.tsx": "Clickable logo component that navigates to the home route with hover and focus effects.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with React Query cache clearing.",
  "frontend/src/components/ncert/ChapterList.tsx": "Renders a list of NCERT chapters with buttons to view or download PDFs, or a fallback if unavailable.",
  "frontend/src/components/ncert/SubjectCard.tsx": "Displays a subject card with expandable chapter list using toggle state.",
  "frontend/src/components/PomodoroTimer/ColorControls.tsx": "Provides preset and custom color pickers to update the timer color with synchronized state.",
  "frontend/src/components/PomodoroTimer/DurationControls.tsx": "Lets users adjust focus and break durations via buttons and number inputs with validation.",
  "frontend/src/components/PomodoroTimer/MetricsPanel.tsx": "Displays daily session count and streak, refreshing metrics on a timed interval.",
  "frontend/src/components/PomodoroTimer/MusicControls.tsx": "Toggles looping background music using local storage and an audio hook.",
  "frontend/src/components/PomodoroTimer/PomodoroTimer.tsx": "Main timer component handling countdown, session transitions, audio cues, quotes, and UI controls.",
  "frontend/src/components/PomodoroTimer/ProgressRing.tsx": "Renders an SVG circular progress indicator with glow effects based on color.",
  "frontend/src/components/PomodoroTimer/SoundControls.tsx": "Provides a toggle for enabling or disabling ticking sounds during the timer.",
  "frontend/src/components/PomodoroTimer/usePomodoroTimer.ts": "Custom hook managing Pomodoro state, durations, color, ticking, and session timing logic.",
  "frontend/src/components/SiteNav.tsx": "Navigation bar with route-aware highlighting and streamer mode hiding on the timer page.",
  "frontend/src/components/SocialLinks.tsx": "Displays Instagram and X social icons with size variations for header or footer.",
  "frontend/src/components/testSeries/ExamSession.tsx": "Manages a timed test-taking session with navigation, answer tracking, and submission handling.",
  "frontend/src/components/testSeries/TestHistory.tsx": "Fetches and displays user test history with loading, error, and empty states.",
  "frontend/src/components/testSeries/TestResults.tsx": "Shows completed test results, save status messages, and summary metrics.",
  "frontend/src/components/ThemeToggleButton.tsx": "Button that switches between light and dark themes using the theme hook.",
  "frontend/src/hooks/community/useChat.ts": "Provides hooks to fetch and send chat messages with periodic updates.",
  "frontend/src/hooks/community/useComments.ts": "Implements hooks for retrieving and adding comments tied to posts.",
  "frontend/src/hooks/community/useModeration.ts": "Contains admin-related hooks for deleting posts, comments, messages, and blocking users.",
  "frontend/src/hooks/community/usePosts.ts": "Provides hooks to fetch, create, and like posts via actor methods.",
  "frontend/src/hooks/community/useUserProfiles.ts": "Fetches user profiles by principal and derives display names.",
  "frontend/src/hooks/testSeries/useCountdownTimer.ts": "Implements a countdown timer with start, stop, and reset controls.",
  "frontend/src/hooks/testSeries/useTestHistory.ts": "Fetches and saves test history data through actor interactions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actors based on Internet Identity and refreshes related queries when the actor changes.",
  "frontend/src/hooks/useAudio.ts": "Provides play/pause controls and state for an HTML audio element instantiated from a source URL.",
  "frontend/src/hooks/useAuthState.ts": "Derives authentication state and principal strings from Internet Identity.",
  "frontend/src/hooks/useDashboardBackground.ts": "Fetches, saves, and clears the dashboard background via backend actor with react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity, login flow, and related context.",
  "frontend/src/hooks/useLocalStorageState.ts": "Syncs a React state value with localStorage for persistence across reloads.",
  "frontend/src/hooks/useQueries.ts": "Handles fetching and saving user profiles via backend actor using react-query.",
  "frontend/src/hooks/useTheme.ts": "Manages dark/light theme state with localStorage persistence.",
  "frontend/src/index.css": "Defines global styles, CSS variables, Tailwind layers, and animated background effects.",
  "frontend/src/lib/branding.ts": "Provides branding constants and helpers for app identity and copyright text.",
  "frontend/src/lib/color.ts": "Contains color utilities for converting hex to RGBA and generating glow or text-shadow effects.",
  "frontend/src/lib/ncertData.ts": "Provides structured NCERT Class 11 and 12 subject and chapter metadata.",
  "frontend/src/lib/quotes.ts": "Stores motivational quotes and returns a random one on request.",
  "frontend/src/lib/studyMetrics.ts": "Manages study session metrics using localStorage, tracking daily sessions and streaks with helper functions to update and retrieve values.",
  "frontend/src/lib/testSeriesData.ts": "Defines test series types and sample questions, and provides helpers for validating exam/category inputs and retrieving questions and durations.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity context, then renders the root App component.",
  "frontend/src/pages/CommunityPage.tsx": "Displays the community feed with posts, chat, and post composer, handling authentication and layout with header and footer branding.",
  "frontend/src/pages/LandingPage.tsx": "Renders the landing dashboard with timer, social links, optional custom background, and global site branding.",
  "frontend/src/pages/NcertPage.tsx": "Shows NCERT book subjects for classes 11 and 12 using SubjectCard components with standard site navigation and footer.",
  "frontend/src/pages/TestSeriesPage.tsx": "Provides test series flow including test selection, running exams, computing results, and optionally saving history when authenticated.",
  "frontend/src/pages/TimerPage.tsx": "Displays a standalone Pomodoro timer with streamer mode and background transparency options stored in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them from the URL when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugins including container queries and animations.",
  "project_state.json": "Project metadata describing implemented features, architecture notes, and site-wide functionality for a study platform with timer, community, NCERT, and test-series pages."
}