{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing social icon, follow text, and streamer-mode requirements with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files and components.",
  "frontend/index.css": "Tailwind base and dark mode CSS variables plus global styles for layout and components.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing and timer pages wrapped in dark mode.",
  "frontend/src/components/PomodoroTimer/ColorControls.tsx": "Color control panel offering preset colors and a custom color picker synced with parent state.",
  "frontend/src/components/PomodoroTimer/DurationControls.tsx": "Controls for adjusting focus and break durations with increment buttons and numeric inputs.",
  "frontend/src/components/PomodoroTimer/MetricsPanel.tsx": "Displays daily session count and study streak fetched periodically from studyMetrics.",
  "frontend/src/components/PomodoroTimer/MusicControls.tsx": "Toggles lo‑fi background music using localStorage-backed state and an audio hook.",
  "frontend/src/components/PomodoroTimer/PomodoroTimer.tsx": "Main Pomodoro timer component handling UI, session flow, audio cues, quotes, and metrics updates.",
  "frontend/src/components/PomodoroTimer/ProgressRing.tsx": "Renders an SVG circular progress indicator with glow styling based on timer progress.",
  "frontend/src/components/PomodoroTimer/SoundControls.tsx": "Provides UI to toggle ticking sound and displays bell notification info.",
  "frontend/src/components/PomodoroTimer/usePomodoroTimer.ts": "Custom hook managing timer state, durations, session switching, persistence, and controls.",
  "frontend/src/components/SocialLinks.tsx": "Renders Instagram and X social media icons with optional size variants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication, refreshing dependent queries.",
  "frontend/src/hooks/useAudio.ts": "Custom hook providing play/pause controls for an HTML audio element with optional looping.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, login flow, stored identity loading, and provider setup.",
  "frontend/src/hooks/useLocalStorageState.ts": "Syncs React state with localStorage, handling serialization and fallback behavior.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables, global styles, typography, and animated background.",
  "frontend/src/lib/color.ts": "Utility functions for hex color parsing, glow and text-shadow generation, and color validation.",
  "frontend/src/lib/quotes.ts": "Provides a list of motivational quotes and a helper to return a random one.",
  "frontend/src/lib/studyMetrics.ts": "Manages study session metrics in localStorage, tracking daily sessions and streaks.",
  "frontend/src/main.tsx": "Application entry point that sets up React rendering with query client and identity provider.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main landing page with header, Pomodoro timer, social links, and footer.",
  "frontend/src/pages/TimerPage.tsx": "Displays the Pomodoro timer with streamer mode and background transparency options stored in localStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Describes project state, features, architecture notes, and metadata for the study website."
}