{
  "kind": "build_request",
  "title": "Update user profile display to show Google account name and photo across Community and add Study Room link",
  "projectName": "Focus Babu",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-100",
      "text": "Remove support for user-supplied/custom usernames in the UI and ensure the displayed name and avatar are sourced only from the authenticated profile data (or fallbacks), with no manual editing controls anywhere in the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Do not allow custom username.",
          "No manual editing of name allowed."
        ]
      },
      "acceptanceCriteria": [
        "All UI components that previously allowed username editing are removed or disabled",
        "Display name is derived exclusively from authenticated profile data",
        "No text input or edit controls for username exist anywhere in the app"
      ]
    },
    {
      "id": "REQ-101",
      "text": "Automatically sync/load the authenticated profile after login so the correct name and profile photo are available without manual steps, and ensure the profile is used consistently in Community (posts, comments, chat) and in Test History.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Name should automatically load after login.",
          "Same name should show in: Chat, Comments, Posts, Test history"
        ]
      },
      "acceptanceCriteria": [
        "Profile data is fetched automatically after successful Internet Identity login",
        "Profile name and photo are immediately available for use across all features",
        "Community posts, comments, and chat messages display the authenticated profile data",
        "Test History displays the authenticated profile data"
      ]
    },
    {
      "id": "REQ-102",
      "text": "Update Community chat, comments, and post headers to display: profile photo (if available), bold display name, timestamp, and message/content below the name, with a clean layout that is dark-mode compatible and does not change other Community behaviors (posting, liking, moderation, polling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Display: Real Name (from Gmail), Profile photo (Google account DP), Timestamp",
          "Name bold, Message below name, Dark mode compatible"
        ]
      },
      "acceptanceCriteria": [
        "Chat messages show profile photo (when available), bold display name, timestamp, and message content below",
        "Comments show profile photo (when available), bold display name, timestamp, and comment text below",
        "Post headers show profile photo (when available), bold display name, and timestamp",
        "Layout is clean, properly spaced, and works in both dark and light modes",
        "Existing Community features (posting, liking, deleting, moderation) continue to work unchanged"
      ]
    },
    {
      "id": "REQ-103",
      "text": "Add a new navbar navigation entry labeled exactly 'Study Room' with a video camera icon (🎥 or 📹 style) that opens the Google Meet link https://meet.google.com/fzn-cjad-ofe in a new tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Add a new icon in navbar: 🎥 or 📹 icon, Name: Study Room",
          "https://meet.google.com/fzn-cjad-ofe",
          "Open link in new tab."
        ]
      },
      "acceptanceCriteria": [
        "A new 'Study Room' entry appears in the top navbar with a video camera icon",
        "Clicking the Study Room entry opens the Google Meet link in a new browser tab",
        "The navbar entry is styled consistently with other navbar items",
        "The Study Room entry does not break existing navbar behavior or Streamer Mode navbar hiding"
      ]
    },
    {
      "id": "REQ-104",
      "text": "Show a confirmation popup before redirecting to the Google Meet link with the message 'You are joining Focus Babu Study Room.' and provide options to proceed or cancel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Show confirmation popup before redirect: 'You are joining Focus Babu Study Room.'"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the Study Room navbar entry, a confirmation dialog appears",
        "The dialog displays the exact message: 'You are joining Focus Babu Study Room.'",
        "The dialog provides clear 'Proceed' and 'Cancel' buttons",
        "Clicking 'Proceed' opens the Google Meet link in a new tab",
        "Clicking 'Cancel' closes the dialog without navigation",
        "The confirmation dialog styling matches the app's clean study-vibe design and is dark-mode compatible"
      ]
    },
    {
      "id": "REQ-105",
      "text": "Add a small description section on the Study Room page or in the confirmation dialog that reads: 'Join live group study session and stay focused together.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Add small description on page: 'Join live group study session and stay focused together.'"
        ]
      },
      "acceptanceCriteria": [
        "The description text 'Join live group study session and stay focused together.' is displayed in the confirmation popup or on a dedicated Study Room page",
        "The text is clearly visible and properly styled",
        "The description fits the clean study-vibe aesthetic and is dark-mode compatible"
      ]
    },
    {
      "id": "REQ-106",
      "text": "Ensure the Study Room feature (navbar entry, confirmation popup, and link redirect) is fully responsive, mobile-friendly, and matches the existing clean study-vibe design with dark-mode compatibility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Keep design clean and study vibe.",
          "Dark mode compatible.",
          "Mobile friendly."
        ]
      },
      "acceptanceCriteria": [
        "The Study Room navbar entry is properly sized and positioned on mobile devices",
        "The confirmation popup is responsive and displays correctly on all screen sizes",
        "All Study Room UI elements work correctly in both dark and light modes",
        "The feature does not introduce any visual inconsistencies with the existing app design"
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture; keep all Motoko logic in the main actor file",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Use only the specified tech stack: React, TypeScript, Tailwind CSS, Shadcn, React Query for frontend",
    "Do not introduce Firebase or any external authentication systems; continue using Internet Identity",
    "Preserve all existing Community features: posting, commenting, chat, liking, moderation, and polling behavior",
    "Do not break Streamer Mode behavior or the /timer route functionality",
    "Maintain backward compatibility with existing user profile data structures"
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity",
    "Creating a full Study Room page with video conferencing features (only redirect to Google Meet)",
    "Allowing users to customize their display name or profile photo within the app",
    "Modifying the backend schema to store Google account credentials",
    "Adding real-time video chat functionality within the app",
    "Creating a separate Study Room scheduling or management system"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}