{
  "kind": "build_request",
  "title": "Add Instagram and X social icons (header + footer), with glow hover and streamer-mode hiding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Update the footer social links to include clickable Instagram and X (Twitter) icons that open in a new tab and point to the provided profiles: https://instagram.com/babu_sarraf_ji and https://x.com/babu_sarraf_ji. Keep icon styling minimal/modern with proper spacing, a soft glow hover effect matching the dark “study vibe” theme, and ensure the icons are responsive on mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add Instagram icon in: Footer section",
          "Link: https://instagram.com/babu_sarraf_ji Open in new tab",
          "Add X icon next to Instagram icon",
          "Clickable link: https://x.com/babu_sarraf_ji Open in new tab",
          "Minimal modern icon style",
          "Soft glow hover effect (match study vibe theme)",
          "Proper spacing between icons",
          "Responsive for mobile and desktop"
        ]
      },
      "acceptanceCriteria": [
        "Footer shows Instagram and X icons adjacent to each other with consistent sizing and spacing.",
        "Clicking the Instagram icon opens https://instagram.com/babu_sarraf_ji in a new tab and includes rel=\"noopener noreferrer\".",
        "Clicking the X icon opens https://x.com/babu_sarraf_ji in a new tab and includes rel=\"noopener noreferrer\".",
        "Hovering either icon shows a soft glow effect consistent with the existing dark theme.",
        "On small screens the footer layout remains readable and the icons do not overflow or overlap other footer content."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add the same Instagram and X social icon links to the top-right corner of the landing page header (near the existing header/profile area), using the same minimal modern style, spacing, and soft glow hover effect. These header icons must open the provided links in a new tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add Instagram icon in: Top right corner (near profile section)",
          "Add X icon next to Instagram icon",
          "Open in new tab",
          "Icons should be minimal and professional"
        ]
      },
      "acceptanceCriteria": [
        "Landing page header displays Instagram and X icons in the top-right area without disrupting the centered logo/tagline.",
        "Both icons open the correct URLs in a new tab with rel=\"noopener noreferrer\".",
        "Icons are visually consistent with the footer versions (size, color, hover glow).",
        "Header remains responsive (icons remain accessible and correctly positioned on mobile and desktop)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add optional follow text under the timer in non-streamer mode: “Follow for daily study motivation – @babu_sarraf_ji”. Ensure it fits the minimal study aesthetic and does not appear in Streamer Mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Optional text under timer: “Follow for daily study motivation – @babu_sarraf_ji”",
          "In Streamer Mode: Social icons should be hidden automatically"
        ]
      },
      "acceptanceCriteria": [
        "When streamerMode is false, the text “Follow for daily study motivation – @babu_sarraf_ji” renders beneath the timer area and matches the existing typography/color system.",
        "When streamerMode is true, the follow text is not rendered."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Ensure any social icons rendered on the /timer route are automatically hidden when Streamer Mode is enabled (to keep the browser-source overlay clean).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "In Streamer Mode: Social icons should be hidden automatically"
        ]
      },
      "acceptanceCriteria": [
        "On /timer, when Streamer Mode is ON, no social icons (Instagram/X) are visible anywhere on the page.",
        "On /timer, when Streamer Mode is OFF, social icons (if shown on that route) display normally with the same styling/hover behavior as the landing page."
      ]
    }
  ],
  "constraints": [
    "Frontend only (no backend changes required).",
    "Do not modify files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT.",
    "All external links must open in a new tab and include rel=\"noopener noreferrer\".",
    "User-facing text must be in English."
  ],
  "nonGoals": [
    "Do not add third-party authentication or social media API integrations (links only).",
    "Do not add tracking/analytics for social link clicks.",
    "Do not change core Pomodoro timer behavior beyond adding the optional follow text in non-streamer mode."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}