{
  "kind": "build_request",
  "title": "Dashboard background image customization (per-user) with upload + reset",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-57",
      "text": "Add a clean, minimal Dashboard UI control section on the Home/Dashboard page (route \"/\") that includes a button labeled exactly \"Change Background\" and a button labeled exactly \"Reset to Default\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Add a button in Dashboard: “Change Background”",
          "Add “Reset to Default” button.",
          "Keep UI clean and study vibe."
        ]
      },
      "acceptanceCriteria": [
        "On route \"/\", the user can see a \"Change Background\" control and a \"Reset to Default\" control in a clean, study-vibe style consistent with the existing UI components.",
        "All user-facing text is English and matches the requested button labels exactly.",
        "Controls are responsive and usable on mobile (buttons not cramped, tap targets reasonable)."
      ]
    },
    {
      "id": "REQ-58",
      "text": "Allow the user to select an image from their device (gallery/files) when clicking \"Change Background\"; validate that the selected file is an image and show a clear English error message if the file is invalid or the upload fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "User can upload image from their gallery."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Change Background\" opens the native file picker and accepts common image formats.",
        "If the selected file is not an image, the UI shows an English validation message and does not apply/save the background.",
        "If saving fails, the UI shows an English error state; the previous background remains unchanged."
      ]
    },
    {
      "id": "REQ-59",
      "text": "Apply the selected image as the background only on the Dashboard/Home page (route \"/\"): the background must cover the full viewport, be properly fitted without stretching (cover + centered), and include a slight dark overlay layer to preserve readability of the existing timer and text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Selected image should be applied only to the Dashboard background.",
          "Cover full screen",
          "Be properly fitted (no stretching)",
          "Have slight dark overlay for readability"
        ]
      },
      "acceptanceCriteria": [
        "When a background is set, route \"/\" displays it full-screen behind existing content.",
        "The background uses a non-stretching fit (equivalent to CSS background-size: cover; background-position: center).",
        "A dark overlay is visible above the image and below the UI content, improving text/timer readability.",
        "Navigating away from \"/\" removes the custom background effect (no impact on other routes)."
      ]
    },
    {
      "id": "REQ-60",
      "text": "Ensure the custom Dashboard background does not affect the Timer page at \"/timer\" (including Streamer Mode and transparent background behavior) and does not introduce any new UI elements onto Streamer Mode views.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Should not affect Streamer Mode timer page."
        ]
      },
      "acceptanceCriteria": [
        "On \"/timer\", the appearance and behavior remain unchanged relative to current behavior, including Streamer Mode hiding UI and transparent background handling.",
        "No Dashboard background image or overlay is applied to \"/timer\" in any mode."
      ]
    },
    {
      "id": "REQ-61",
      "text": "Persist the Dashboard background per user account: signed-in users (Internet Identity) must have their selected background saved to their account and restored automatically on returning to the Dashboard; signed-out users can view the default background and must see a clear English prompt to sign in if they attempt to change or reset the Dashboard background.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Save background per user account."
        ]
      },
      "acceptanceCriteria": [
        "If the user is signed in, setting a background persists it to the backend and it is restored on page reload and future visits.",
        "If the user is signed out, clicking \"Change Background\" or \"Reset to Default\" shows an English prompt indicating sign-in is required to save the Dashboard background.",
        "Signed-out users continue to see the default Dashboard background."
      ]
    },
    {
      "id": "REQ-62",
      "text": "Implement backend support (Motoko, single-actor) for storing, retrieving, and clearing a per-user Dashboard background image, using Internet Identity principal as the key and using existing blob storage types already used for community post images.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Save background per user account."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes Candid methods to: (1) get the caller’s current Dashboard background image (optional), (2) set/update the caller’s Dashboard background image, and (3) clear/reset the caller’s Dashboard background image.",
        "Backend enforces that only authenticated users with user permission can set/get/clear their own Dashboard background.",
        "The stored background is keyed by caller principal so it is per-account."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Wire the Dashboard UI to the backend methods using React Query patterns consistent with existing hooks (e.g., actor availability checks, query invalidation on mutation) so that after upload/reset the UI updates immediately and restores state on load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ]
      },
      "acceptanceCriteria": [
        "On Dashboard load, the app queries for the signed-in user’s saved background and applies it if present.",
        "After uploading a new background, the UI updates without requiring a manual refresh.",
        "After clicking \"Reset to Default\", the UI reverts to the default background and persists the reset for that signed-in user.",
        "React Query cache is invalidated/refetched appropriately after mutations so state stays consistent."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only shadcn components). Compose them instead.",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if needed for state upgrade."
  ],
  "nonGoals": [
    "Do not apply the uploaded background to /timer, /community, /ncert, or /test-series pages.",
    "Do not add new authentication providers; use existing Internet Identity only.",
    "Do not redesign the entire Dashboard; only add the requested background customization controls and styling needed for readability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}