{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Consistent authenticated profile name/photo across Community and Test History (frontend)",
  "requirements": [
    {
      "id": "REQ-97",
      "summary": "Remove any custom username UI and ensure all displayed names/avatars resolve only from authenticated profile fields with the required fallback order.",
      "acceptanceCriteria": [
        "There is no input, modal, settings panel, or editable UI that allows setting or changing a username/display name.",
        "Any existing display-name helper logic is updated to read from the authenticated profile fields and apply the fallback order (name → email → short principal).",
        "All user-facing text remains English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/userIdentity.ts",
          "operation": "create",
          "description": "Centralize identity rendering helpers: resolve display name with deterministic fallback (displayName → email → short principal) and derive stable initials for avatar fallback. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/community/useUserProfiles.ts",
          "operation": "modify",
          "description": "Replace ad-hoc displayName logic with the shared resolver from frontend/src/lib/userIdentity.ts and return a consistent resolved name for any principal; ensure email fallback is used when displayName is empty/missing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Stop treating profile as user-editable in the UI layer: keep read hooks, but ensure any save/mutation hook is not required by UI flows for name display; update types/usage to align with authenticated profile being the only source of truth. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-98",
      "summary": "Automatically load the authenticated profile after Internet Identity login and use it consistently across Community and Test History, including clean avatar fallbacks.",
      "acceptanceCriteria": [
        "After a successful Internet Identity login, the app triggers a profile sync/load flow and the UI updates to show the best available display name without requiring a refresh.",
        "Community feed items (posts), comments, and chat messages all show the same resolved author name for a given principal.",
        "Test History shows the signed-in user identity (resolved name and photo if available) in a consistent place (e.g., header area) without altering stored result rows or breaking existing history rendering.",
        "If profile photo URL is missing, the UI renders a clean fallback avatar (e.g., initial/circle) without layout shift."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/user/UserAvatar.tsx",
          "operation": "create",
          "description": "Add a reusable avatar component that displays the authenticated photo URL when present and otherwise renders a fixed-size dark-mode-friendly initials/circle fallback (no layout shift). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/user/AuthProfileBootstrapper.tsx",
          "operation": "create",
          "description": "Add a small non-visual component that runs after authentication to prefetch/load the caller profile into React Query cache (using the authorization component’s getCallerUserProfile capability) so the UI updates without refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire AuthProfileBootstrapper into the top-level layout so profile loading runs automatically after Internet Identity login and on identity changes, without affecting streamer mode or /timer UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/testSeries/TestHistory.tsx",
          "operation": "modify",
          "description": "Add a compact signed-in identity header area (resolved name + UserAvatar) above the existing history table, without changing stored rows or existing rendering behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-99",
      "summary": "Update Community chat, comments, and post headers to show avatar, bold author name, timestamp, and content below name in a clean dark-mode-compatible layout without changing other Community behaviors.",
      "acceptanceCriteria": [
        "Chat message rows display an avatar next to the author block, author name is visually bold, timestamp is present, and message text renders below the name line.",
        "Comment items display an avatar (when available), bold author name, timestamp, and comment content below.",
        "Post header displays the author avatar (when available), bold author name, and timestamp; existing admin actions (delete/block) remain unchanged.",
        "All updated layouts look correct in both dark and light modes and remain mobile-friendly.",
        "No changes to Streamer Mode behavior or /timer UI occur as a result of these updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/community/ChatPanel.tsx",
          "operation": "modify",
          "description": "Refactor chat rows to the required layout (UserAvatar + bold resolved author name + timestamp + message below name) while preserving admin delete, polling/refresh behavior, and existing chat functionality. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/community/CommentsSection.tsx",
          "operation": "modify",
          "description": "Update comment items to include UserAvatar and the required author block layout (bold name, timestamp, content below) without changing add/delete behavior or moderation permissions UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/community/PostCard.tsx",
          "operation": "modify",
          "description": "Update post header to include UserAvatar, bold resolved author name, and timestamp while leaving like/comment/admin block/delete behaviors unchanged; ensure mobile-friendly spacing and dark-mode compatibility. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}